let adcodes = [{'adcode': 100000, 'name': '全国'}, {'adcode': 110000, 'name': '北京市'}, {
  'adcode': 120000,
  'name': '天津市'
}, {'adcode': 130000, 'name': '河北省'}, {'adcode': 140000, 'name': '山西省'}, {
  'adcode': 150000,
  'name': '内蒙古自治区'
}, {'adcode': 210000, 'name': '辽宁省'}, {'adcode': 220000, 'name': '吉林省'}, {
  'adcode': 230000,
  'name': '黑龙江省'
}, {'adcode': 310000, 'name': '上海市'}, {'adcode': 320000, 'name': '江苏省'}, {
  'adcode': 330000,
  'name': '浙江省'
}, {'adcode': 340000, 'name': '安徽省'}, {'adcode': 350000, 'name': '福建省'}, {
  'adcode': 360000,
  'name': '江西省'
}, {'adcode': 370000, 'name': '山东省'}, {'adcode': 410000, 'name': '河南省'}, {
  'adcode': 420000,
  'name': '湖北省'
}, {'adcode': 430000, 'name': '湖南省'}, {'adcode': 440000, 'name': '广东省'}, {
  'adcode': 450000,
  'name': '广西壮族自治区'
}, {'adcode': 460000, 'name': '海南省'}, {'adcode': 500000, 'name': '重庆市'}, {
  'adcode': 510000,
  'name': '四川省'
}, {'adcode': 520000, 'name': '贵州省'}, {'adcode': 530000, 'name': '云南省'}, {
  'adcode': 540000,
  'name': '西藏自治区'
}, {'adcode': 610000, 'name': '陕西省'}, {'adcode': 620000, 'name': '甘肃省'}, {
  'adcode': 630000,
  'name': '青海省'
}, {'adcode': 640000, 'name': '宁夏回族自治区'}, {'adcode': 650000, 'name': '新疆维吾尔自治区'}, {
  'adcode': 810000,
  'name': '香港特别行政区'
}, {'adcode': 820000, 'name': '澳门特别行政区'}]

// 城市经纬度
// let theCitys = {
//   '广州': '113.486779,23.339803',
//   '深圳': '114.058068,22.601402',
//   '珠海': '113.321984,22.103523',
//   '汕头': '116.573937,23.289356',
//   '佛山': '112.981408,23.036839',
//   '韶关': '113.596642,24.884013',
//   '河源': '114.882043,23.953694',
//   '梅州': '116.101525,24.31463',
//   '惠州': '114.431603,23.107592',
//   '汕尾': '115.552209,23.036839',
//   '东莞': '113.78341,22.966049',
//   '中山': '113.398888,22.510089',
//   '江门': '112.707213,22.272385',
//   '阳江': '111.794884,22.011883',
//   '湛江': '110.037072,21.153746',
//   '茂名': '110.872033,21.950757',
//   '肇庆': '112.179406,23.541396',
//   '清远': '112.981408,24.194432',
//   '潮州': '116.782677,23.792953',
//   '揭阳': '116.05758,23.420477',
//   '云浮': '111.728966,22.864856'
// }
// 城市经纬度
let theCitys = [{'name': '广州', 'lnglat': '113.486779,23.339803'}, {
  'name': '深圳',
  'lnglat': '114.058068,22.601402'
}, {'name': '珠海', 'lnglat': '113.321984,22.103523'}, {'name': '汕头', 'lnglat': '116.573937,23.289356'}, {
  'name': '佛山',
  'lnglat': '112.981408,23.036839'
}, {'name': '韶关', 'lnglat': '113.596642,24.884013'}, {'name': '河源', 'lnglat': '114.882043,23.953694'}, {
  'name': '梅州',
  'lnglat': '116.101525,24.31463'
}, {'name': '惠州', 'lnglat': '114.431603,23.107592'}, {'name': '汕尾', 'lnglat': '115.552209,23.036839'}, {
  'name': '东莞',
  'lnglat': '113.78341,22.966049'
}, {'name': '中山', 'lnglat': '113.398888,22.510089'}, {'name': '江门', 'lnglat': '112.707213,22.272385'}, {
  'name': '阳江',
  'lnglat': '111.794884,22.011883'
}, {'name': '湛江', 'lnglat': '110.037072,21.153746'}, {'name': '茂名', 'lnglat': '110.872033,21.950757'}, {
  'name': '肇庆',
  'lnglat': '112.179406,23.541396'
}, {'name': '清远', 'lnglat': '112.981408,24.194432'}, {'name': '潮州', 'lnglat': '116.782677,23.792953'}, {
  'name': '揭阳',
  'lnglat': '116.05758,23.420477'
}, {'name': '云浮', 'lnglat': '111.728966,22.864856'}]

// 21个地市 行政区号数据
let theCityData = [
  {
    'name': '广州',
    'adcode': 440100,
    'sub': [{'name': '荔湾区', 'adcode': 440103}, {'name': '越秀区', 'adcode': 440104}, {
      'name': '海珠区',
      'adcode': 440105
    }, {'name': '天河区', 'adcode': 440106}, {'name': '白云区', 'adcode': 440111}, {
      'name': '黄埔区',
      'adcode': 440112
    }, {'name': '番禺区', 'adcode': 440113}, {'name': '花都区', 'adcode': 440114}, {
      'name': '南沙区',
      'adcode': 440115
    }, {'name': '从化区', 'adcode': 440117}, {'name': '增城区', 'adcode': 440118}]
  },
  {
    'name': '韶关',
    'adcode': 440200,
    'sub': [{'name': '武江区', 'adcode': 440203}, {'name': '浈江区', 'adcode': 440204}, {
      'name': '曲江区',
      'adcode': 440205
    }, {'name': '始兴县', 'adcode': 440222}, {'name': '仁化县', 'adcode': 440224}, {
      'name': '翁源县',
      'adcode': 440229
    }, {'name': '乳源瑶族自治县', 'adcode': 440232}, {'name': '新丰县', 'adcode': 440233}, {
      'name': '乐昌市',
      'adcode': 440281
    }, {'name': '南雄市', 'adcode': 440282}]
  },
  {
    'name': '深圳',
    'adcode': 440300,
    'sub': [{'name': '罗湖区', 'adcode': 440303}, {'name': '福田区', 'adcode': 440304}, {
      'name': '南山区',
      'adcode': 440305
    }, {'name': '宝安区', 'adcode': 440306}, {'name': '龙岗区', 'adcode': 440307}, {
      'name': '盐田区',
      'adcode': 440308
    }, {'name': '龙华区', 'adcode': 440309}, {'name': '坪山区', 'adcode': 440310}, {'name': '光明区', 'adcode': 440311}]
  }, {
    'name': '珠海',
    'adcode': 440400,
    'sub': [{'name': '香洲区', 'adcode': 440402}, {'name': '斗门区', 'adcode': 440403}, {'name': '金湾区', 'adcode': 440404}]
  },
  {
    'name': '汕头',
    'adcode': 440500,
    'sub': [{'name': '龙湖区', 'adcode': 440507}, {'name': '金平区', 'adcode': 440511}, {
      'name': '濠江区',
      'adcode': 440512
    }, {'name': '潮阳区', 'adcode': 440513}, {'name': '潮南区', 'adcode': 440514}, {
      'name': '澄海区',
      'adcode': 440515
    }, {'name': '南澳县', 'adcode': 440523}]
  }, {
    'name': '佛山',
    'adcode': 440600,
    'sub': [{'name': '禅城区', 'adcode': 440604}, {'name': '南海区', 'adcode': 440605}, {
      'name': '顺德区',
      'adcode': 440606
    }, {'name': '三水区', 'adcode': 440607}, {'name': '高明区', 'adcode': 440608}]
  }, {
    'name': '江门',
    'adcode': 440700,
    'sub': [{'name': '蓬江区', 'adcode': 440703}, {'name': '江海区', 'adcode': 440704}, {
      'name': '新会区',
      'adcode': 440705
    }, {'name': '台山市', 'adcode': 440781}, {'name': '开平市', 'adcode': 440783}, {
      'name': '鹤山市',
      'adcode': 440784
    }, {'name': '恩平市', 'adcode': 440785}]
  }, {
    'name': '湛江',
    'adcode': 440800,
    'sub': [{'name': '赤坎区', 'adcode': 440802}, {'name': '霞山区', 'adcode': 440803}, {
      'name': '坡头区',
      'adcode': 440804
    }, {'name': '麻章区', 'adcode': 440811}, {'name': '遂溪县', 'adcode': 440823}, {
      'name': '徐闻县',
      'adcode': 440825
    }, {'name': '廉江市', 'adcode': 440881}, {'name': '雷州市', 'adcode': 440882}, {'name': '吴川市', 'adcode': 440883}]
  }, {
    'name': '茂名',
    'adcode': 440900,
    'sub': [{'name': '茂南区', 'adcode': 440902}, {'name': '电白区', 'adcode': 440904}, {
      'name': '高州市',
      'adcode': 440981
    }, {'name': '化州市', 'adcode': 440982}, {'name': '信宜市', 'adcode': 440983}]
  }, {
    'name': '肇庆',
    'adcode': 441200,
    'sub': [{'name': '端州区', 'adcode': 441202}, {'name': '鼎湖区', 'adcode': 441203}, {
      'name': '高要区',
      'adcode': 441204
    }, {'name': '广宁县', 'adcode': 441223}, {'name': '怀集县', 'adcode': 441224}, {
      'name': '封开县',
      'adcode': 441225
    }, {'name': '德庆县', 'adcode': 441226}, {'name': '四会市', 'adcode': 441284}]
  }, {
    'name': '惠州',
    'adcode': 441300,
    'sub': [{'name': '惠城区', 'adcode': 441302}, {'name': '惠阳区', 'adcode': 441303}, {
      'name': '博罗县',
      'adcode': 441322
    }, {'name': '惠东县', 'adcode': 441323}, {'name': '龙门县', 'adcode': 441324}]
  }, {
    'name': '梅州',
    'adcode': 441400,
    'sub': [{'name': '梅江区', 'adcode': 441402}, {'name': '梅县区', 'adcode': 441403}, {
      'name': '大埔县',
      'adcode': 441422
    }, {'name': '丰顺县', 'adcode': 441423}, {'name': '五华县', 'adcode': 441424}, {
      'name': '平远县',
      'adcode': 441426
    }, {'name': '蕉岭县', 'adcode': 441427}, {'name': '兴宁市', 'adcode': 441481}]
  }, {
    'name': '汕尾',
    'adcode': 441500,
    'sub': [{'name': '城区', 'adcode': 441502}, {'name': '海丰县', 'adcode': 441521}, {
      'name': '陆河县',
      'adcode': 441523
    }, {'name': '陆丰市', 'adcode': 441581}]
  }, {
    'name': '河源',
    'adcode': 441600,
    'sub': [{'name': '源城区', 'adcode': 441602}, {'name': '紫金县', 'adcode': 441621}, {
      'name': '龙川县',
      'adcode': 441622
    }, {'name': '连平县', 'adcode': 441623}, {'name': '和平县', 'adcode': 441624}, {'name': '东源县', 'adcode': 441625}]
  }, {
    'name': '阳江',
    'adcode': 441700,
    'sub': [{'name': '江城区', 'adcode': 441702}, {'name': '阳东区', 'adcode': 441704}, {
      'name': '阳西县',
      'adcode': 441721
    }, {'name': '阳春市', 'adcode': 441781}]
  }, {
    'name': '清远',
    'adcode': 441800,
    'sub': [{'name': '清城区', 'adcode': 441802}, {'name': '清新区', 'adcode': 441803}, {
      'name': '佛冈县',
      'adcode': 441821
    }, {'name': '阳山县', 'adcode': 441823}, {'name': '连山壮族瑶族自治县', 'adcode': 441825}, {
      'name': '连南瑶族自治县',
      'adcode': 441826
    }, {'name': '英德市', 'adcode': 441881}, {'name': '连州市', 'adcode': 441882}]
  }, {'name': '东莞', 'adcode': 441900, 'sub': []}, {
    'name': '中山',
    'adcode': 442000,
    'sub': []
  },
  // {'name': '东沙群岛', 'adcode': 442100},
  {
    'name': '潮州',
    'adcode': 445100,
    'sub': [{'name': '湘桥区', 'adcode': 445102}, {'name': '潮安区', 'adcode': 445103}, {'name': '饶平县', 'adcode': 445122}]
  }, {
    'name': '揭阳',
    'adcode': 445200,
    'sub': [{'name': '榕城区', 'adcode': 445202}, {'name': '揭东区', 'adcode': 445203}, {
      'name': '揭西县',
      'adcode': 445222
    }, {'name': '惠来县', 'adcode': 445224}, {'name': '普宁市', 'adcode': 445281}]
  }, {
    'name': '云浮',
    'adcode': 445300,
    'sub': [{'name': '云城区', 'adcode': 445302}, {'name': '云安区', 'adcode': 445303}, {
      'name': '新兴县',
      'adcode': 445321
    }, {'name': '郁南县', 'adcode': 445322}, {'name': '罗定市', 'adcode': 445381}]
  }
]
export { adcodes, theCitys, theCityData }
