let adcodes = [{'adcode': 100000, 'name': '全国'}, {'adcode': 110000, 'name': '北京市'}, {
  'adcode': 120000,
  'name': '天津市'
}, {'adcode': 130000, 'name': '河北省'}, {'adcode': 140000, 'name': '山西省'}, {
  'adcode': 150000,
  'name': '内蒙古自治区'
}, {'adcode': 210000, 'name': '辽宁省'}, {'adcode': 220000, 'name': '吉林省'}, {
  'adcode': 230000,
  'name': '黑龙江省'
}, {'adcode': 310000, 'name': '上海市'}, {'adcode': 320000, 'name': '江苏省'}, {
  'adcode': 330000,
  'name': '浙江省'
}, {'adcode': 340000, 'name': '安徽省'}, {'adcode': 350000, 'name': '福建省'}, {
  'adcode': 360000,
  'name': '江西省'
}, {'adcode': 370000, 'name': '山东省'}, {'adcode': 410000, 'name': '河南省'}, {
  'adcode': 420000,
  'name': '湖北省'
}, {'adcode': 430000, 'name': '湖南省'}, {'adcode': 440000, 'name': '广东省'}, {
  'adcode': 450000,
  'name': '广西壮族自治区'
}, {'adcode': 460000, 'name': '海南省'}, {'adcode': 500000, 'name': '重庆市'}, {
  'adcode': 510000,
  'name': '四川省'
}, {'adcode': 520000, 'name': '贵州省'}, {'adcode': 530000, 'name': '云南省'}, {
  'adcode': 540000,
  'name': '西藏自治区'
}, {'adcode': 610000, 'name': '陕西省'}, {'adcode': 620000, 'name': '甘肃省'}, {
  'adcode': 630000,
  'name': '青海省'
}, {'adcode': 640000, 'name': '宁夏回族自治区'}, {'adcode': 650000, 'name': '新疆维吾尔自治区'}, {
  'adcode': 810000,
  'name': '香港特别行政区'
}, {'adcode': 820000, 'name': '澳门特别行政区'}]

//  标注城市
let theCitys = {
  '广州市': '113.486779,23.339803',
  '深圳市': '114.058068,22.601402',
  '珠海市': '113.321984,22.103523',
  '汕头市': '116.573937,23.289356',
  '佛山市': '112.981408,23.036839',
  '韶关市': '113.596642,24.884013',
  '河源市': '114.882043,23.953694',
  '梅州市': '116.101525,24.31463',
  '惠州市': '114.431603,23.107592',
  '汕尾市': '115.552209,23.036839',
  '东莞市': '113.78341,22.966049',
  '中山市': '113.398888,22.510089',
  '江门市': '112.707213,22.272385',
  '阳江市': '111.794884,22.011883',
  '湛江市': '110.037072,21.153746',
  '茂名市': '110.872033,21.950757',
  '肇庆市': '112.179406,23.541396',
  '清远市': '112.981408,24.194432',
  '潮州市': '116.782677,23.792953',
  '揭阳市': '116.05758,23.420477',
  '云浮市': '111.728966,22.864856'
}
export { adcodes, theCitys }
